import pytest
import pandas as pd

@pytest.fixture
def sample_transactions():
    data = {
        "date": [
            "2023-01-01",
            "2023-01-02",
            "2023-01-03",
            "2023-01-04",
            "2023-01-05",
            "2023-01-06",
            "2023-01-07",
            "2023-01-08",
            "2023-01-09",
            "2023-01-10",
        ],
        "amount": [100, 200, 150, 300, 250, 100, 50, 80, 90, 120],
    }
    return pd.DataFrame(data)

@pytest.fixture
def get_excel_0():
    return {
        "Дата операции": "02.11.2021 10:05:06",
        "Дата платежа": "02.11.2021",
        "Номер карты": "*4556",
        "Статус": "OK",
        "Сумма операции": -69.99,
        "Валюта операции": "RUB",
        "Сумма платежа": -69.99,
        "Валюта платежа": "RUB",
        "Кэшбэк": 3.0,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 3,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 69.99,
    }